In [1]:
# Import Libraries

import pandas as pd
import numpy as np
import os

In [ ]:
## Importing Dataframes

In [32]:
#Products Dataframe

df_prods = pd.read_csv(r'/Users/pedropaulo/Desktop/Tasks CF/Instacart Basket Analysis/Data/Prepared Data/products_checked.csv', index_col=False,sep=',')

In [33]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61.0,19.0,5.8
1,1,2,All-Seasons Salt,104.0,13.0,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94.0,7.0,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38.0,1.0,10.5
4,4,5,Green Chile Anytime Sauce,5.0,13.0,4.3

In [36]:
# Drop the unnecessary Column

df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [37]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61.0,19.0,5.8
1,2,All-Seasons Salt,104.0,13.0,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94.0,7.0,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38.0,1.0,10.5
4,5,Green Chile Anytime Sauce,5.0,13.0,4.3

In [11]:
df_prods.shape

(49672, 6)

In [ ]:
# Orders_prior Dataframe

In [39]:
df_ords_prods_combined = pd.read_pickle(r'/Users/pedropaulo/Desktop/Tasks CF/Instacart Basket Analysis/Data/Prepared Data/orders_products_combined.pkl')

In [40]:
df_ords_prods_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [41]:
df_ords_prods_combined.shape

(9927471, 10)

In [45]:
#Drop the '_merge' column from the dataframe ords_prods_combined
df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

In [46]:
# Product_id matches in both dataframes
df_merged = df_ords_prods_combined.merge(df_prods, on = 'product_id', indicator = True)

In [47]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77.0,7.0,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77.0,7.0,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77.0,7.0,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77.0,7.0,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77.0,7.0,9.0,both

In [ ]:
# Checking Merged Dataframe

In [48]:
df_merged['_merge'].value_counts()

both          9918253
left_only           0
right_only          0
Name: _merge, dtype: int64

In [50]:
df_merged.shape

(9918253, 14)

In [51]:
# Exporting Merged Dataframe as Pickle

df_merged.to_pickle(r'/Users/pedropaulo/Desktop/Tasks CF/Instacart Basket Analysis/Data/Prepared Data/orders_products_merged.pkl')